clear 
clc
%输入参数————————————————————————————————————————————
guiji=xlsread('KL16-1-A25井眼轨迹.xlsx');
%基本参数————————————————————————————————————————————
pailiang=1500      %排量，L/min
Dw=0.2159          %井眼直径，m
Rzz=0.127          %钻柱外径，m
rzz=0.1086         %钻柱内径，m
Lzz=4190           %钻柱长度，m
Rzt=0.15875        %钻铤外径，m
rzt=0.07144        %钻铤内径，m
Lzt=10             %钻铤长度，m
%钻井液————————————————————————————————————————————
lbmx=3             %流变模式：1宾汉流体；2幂律流体；3赫巴流体
fluidden=1170      %钻井液密度，kg/m3   
n=0.48             %流性指数
K=1.09             %稠度系数，pa·s^n
miu=0.021          %塑性粘度，Pa·s
taof=14            %屈服值，Pa
%钻头压降————————————————————————————————————————————
A1=16              %喷嘴1尺寸，mm
C1=7               %喷嘴1个数
A2=0               %喷嘴2尺寸，mm
C2=0               %喷嘴2个数
A3=0               %喷嘴3尺寸，mm
C3=0               %喷嘴3个数
%钻杆接头系数————————————————————————————————————————
Lp=10              %单根钻杆长度，m
Li=0.3             %接头长度，m
rzzjt=0.0953       %接头内径，m
%地面管汇压耗————————————————————————————————————————
L1=30              %地面高压管线长度，m
d1=0.1086          %地面高压管线内径，m
L2=30              %立管长度，m
d2=0.1086          %立管内径，m
L3=30              %水龙带长度，m
d3=0.1086          %水龙带内径，m
L4=11.4            %方钻杆长度，m
d4=0.0826          %方钻杆内径，m
%岩屑床——————————————————————————————————————————————
yx=0               %是否考虑岩屑：0不考虑，1考虑
yxmd=2500          %岩屑密度，kg/m3
H=10               %岩屑床高度，%
[P,Plg,Pdm,Pgn,Phk,ECD,Pgnyx,Phkyx,ECDyx,Sk]=Hydro(guiji,lbmx,pailiang,fluidden,n,K,miu,taof,Dw,A1,C1,A2,C2,A3,C3,Rzz,rzz,Lzz,Rzt,rzt,Lzt,L1,d1,L2,d2,L3,d3,L4,d4,Lp,Li,rzzjt,yxmd,H,yx);

if yx==0
%作循环压力图—————————————————————————————————————————————————————————
figure;
plot(Pgn, Sk, 'b-', 'DisplayName', '钻柱');
hold on;
plot(Phk, Sk, 'r-', 'DisplayName', '环空');
xlabel('循环压力（MPa）'); % X轴标签
ylabel('井深（m）'); % Y轴标签
set(gca, 'YDir', 'reverse'); % Y轴反转，使井深从下到上变化
legend('Location', 'southwest'); % 图例位置设置
% % 设置图形窗口和坐标轴的背景颜色为白色
% set(gcf, 'color', 'w');  % 将图形窗口的背景颜色设置为白色
% set(gca, 'color', 'w');  % 将坐标轴区域的背景颜色设置为白色
%导出钻柱循环压力数据——————————————————————————————————————————————————————
writematrix(Pgn, '钻柱循环压力.xlsx', 'Sheet', 1);
%导出环空循环压力数据——————————————————————————————————————————————————————
writematrix(Phk, '环空循环压力.xlsx', 'Sheet', 1);

%作ECD图————————————————————————————————————————————
figure;
plot(ECD, Sk);
xlabel('ECD（g/cm3）');
ylabel('井深（m）');
set(gca, 'YDir', 'reverse'); % Y轴反转，使井深从下到上变化
% % 设置图形窗口和坐标轴的背景颜色为白色
% set(gcf, 'color', 'w');  % 将图形窗口的背景颜色设置为白色
% set(gca, 'color', 'w');  % 将坐标轴区域的背景颜色设置为白色
%导出ECD数据——————————————————————————————————————————————————————
writematrix(ECD, 'ECD.xlsx', 'Sheet', 1);

elseif yx==1
%作循环压力图—————————————————————————————————————————————————————————
figure;
plot(Pgnyx, Sk, 'b-', 'DisplayName', '钻柱');
hold on;
plot(Phkyx, Sk, 'r-', 'DisplayName', '环空');
xlabel('循环压力（MPa）'); % X轴标签
ylabel('井深（m）'); % Y轴标签
set(gca, 'YDir', 'reverse'); % Y轴反转，使井深从下到上变化
legend('Location', 'southwest'); % 图例位置设置
% % 设置图形窗口和坐标轴的背景颜色为白色
% set(gcf, 'color', 'w');  % 将图形窗口的背景颜色设置为白色
% set(gca, 'color', 'w');  % 将坐标轴区域的背景颜色设置为白色
%导出钻柱循环压力数据——————————————————————————————————————————————————————
writematrix(Pgnyx, '钻柱循环压力.xlsx', 'Sheet', 1);
%导出环空循环压力数据——————————————————————————————————————————————————————
writematrix(Phkyx, '环空循环压力.xlsx', 'Sheet', 1);

%作ECD图————————————————————————————————————————————
figure;
plot(ECDyx, Sk);
xlabel('ECD（g/cm3）');
ylabel('井深（m）');
set(gca, 'YDir', 'reverse'); % Y轴反转，使井深从下到上变化
% % 设置图形窗口和坐标轴的背景颜色为白色
% set(gcf, 'color', 'w');  % 将图形窗口的背景颜色设置为白色
% set(gca, 'color', 'w');  % 将坐标轴区域的背景颜色设置为白色
%导出ECD数据——————————————————————————————————————————————————————
writematrix(ECDyx, 'ECD.xlsx', 'Sheet', 1);

end