clear 
clc
%输入参数————————————————————————————————————————————
guiji=xlsread('KL16-1-A25井眼轨迹.xlsx');
pailiang=1500      %排量，L/min
Dw=0.2159          %井眼直径，m
Rzz=0.127          %钻柱外径，m
rzz=0.1086         %钻柱内径，m
Lzz=4190           %钻柱长度，m
Rzt=0.15875        %钻铤外径，m
rzt=0.07144        %钻铤内径，m
Lzt=10             %钻铤长度，m
jsjg=500           %井深计算间隔，m
%钻井液—————————————————————————————————————————————
lbmx=1             %流变模型：1宾汉；2幂律；3赫巴
fluidden=1170      %钻井液密度，kg/m3   
n=0.48             %幂律指数
K=1.09             %稠度系数，pa·s^n
miu=0.021          %塑性粘度，Pa·s
taof=14            %屈服值，Pa
%钻头压降————————————————————————————————————————————
A1=16              %喷嘴1尺寸，mm
C1=7               %喷嘴1个数
A2=0               %喷嘴2尺寸，mm
C2=0               %喷嘴2个数
A3=0               %喷嘴3尺寸，mm
C3=0               %喷嘴3个数
%钻杆接头系数————————————————————————————————————————
Lp=10              %单根钻杆长度，m
Li=0.3             %接头长度，m
rzzjt=0.0953       %接头内径，m
%地面管汇压耗————————————————————————————————————————
L1=30              %地面高压管线长度，m
d1=0.1086          %地面高压管线内径，m
L2=30              %立管长度，m
d2=0.1086          %立管内径，m
L3=30              %水龙带长度，m
d3=0.1086          %水龙带内径，m
L4=11.4            %方钻杆长度，m
d4=0.0826          %方钻杆内径，m
%岩屑床——————————————————————————————————————————————
yxmd=2500          %岩屑密度，kg/m3
H=10               %岩屑床高度，%
[Pyx,Plg,yssd]=Hydro(guiji,lbmx,pailiang,fluidden,n,K,miu,taof,Dw,A1,C1,A2,C2,A3,C3,Rzz,rzz,Lzz,Rzt,rzt,Lzt,L1,d1,L2,d2,L3,d3,L4,d4,Lp,Li,rzzjt,yxmd,H,jsjg);

%输出立管压力图————————————————————————————————————————————
figure;
x_coords = [jsjg * (1:size(Plg, 2) - 1), yssd]; % 计算横坐标，包括 jsjg 间隔和最终深度 yssd
plot(x_coords,Plg(1,:));
xlabel('井深（m）'); % x轴标签
ylabel('立管压力（MPa）'); % y轴标签
%导出立管压力数据————————————————————————————————————————————
dataToExport = [x_coords' (Plg(1, :))'];
writematrix(dataToExport, '立管压力.xlsx', 'Sheet', 1, 'Range', 'A1');

%输出总循环压耗图————————————————————————————————————————————
figure;
x_coords = [jsjg * (1:size(Pyx, 2) - 1), yssd]; % 计算横坐标，包括 jsjg 间隔和最终深度 yssd
plot(x_coords,Pyx(1,:));
xlabel('井深（m）'); % x轴标签
ylabel('总循环压耗（MPa）'); % y轴标签
%导出总循环压耗数据————————————————————————————————————————————
dataToExport = [x_coords' (Pyx(1, :))'];
writematrix(dataToExport, '总循环压耗.xlsx', 'Sheet', 1, 'Range', 'A1');