clear
clc
%ÊäÈë²ÎÊý¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª
guiji=xlsread('KL16-1-A25¾®ÑÛ¹ì¼£_6000m.xlsx');
zuanju=xlsread('×ê¾ß×éºÏ.xlsx');
Holedia=0.2159;    %¾®ÑÛÖ±¾¶£¬m
ml=2.1e5;          %×êÖùµ¯ÐÔÄ£Á¿£¬MPa
js=6000            %¼ÆËã¾®Éî£¬m

[fh,fs]=abcfunc4(guiji,Holedia,ml,zuanju,js);

%Êä³öÕýÏÒÇüÇúÁÙ½çÔØºÉÍ¼¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª
figure;
plot(fs);
xlabel('¾®Éî£¨m£©'); % xÖá±êÇ©
ylabel('ÕýÏÒÇüÇúÁÙ½çÔØºÉ£¨kN£©'); % yÖá±êÇ©
%µ¼³öÕýÏÒÇüÇúÁÙ½çÔØºÉÊý¾Ý¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª
writematrix(fs, 'ÕýÏÒÇüÇúÁÙ½çÔØºÉ.xlsx', 'Sheet', 1);
%Êä³öÂÝÐýÇüÇúÁÙ½çÔØºÉÍ¼¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª
figure;
plot(fh);
xlabel('¾®Éî£¨m£©'); % xÖá±êÇ©
ylabel('ÂÝÐýÇüÇúÁÙ½çÔØºÉ£¨kN£©'); % yÖá±êÇ©
%µ¼³öÂÝÐýÇüÇúÁÙ½çÔØºÉÊý¾Ý¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª
writematrix(fh, 'ÂÝÐýÇüÇúÁÙ½çÔØºÉ.xlsx', 'Sheet', 1);